command = ('Добро пожаловать в мир, где ты пройдёшь историю обычной девушки старшей школы.'
           'А я бот ми расскажу, что я умею \n'
           'Я могу общаться с тобой \n'
           '-Начать историю /start_story,\n'
           '-Начать общение с ботом /start')

epilog = ('Вы - Пан Да Ми, ученица старшей школы , которая мечтает стать популярным айдолом. \n'
          "Вы с детства занимаетесь хип-хопом, а так же хорошо поёте. Ваша мечта стать самой популярной артисткой в Корее. "
          "Благодарю долгим и усердным тренировкам вы готовы пройти на прослушиание, чтобы стать настоящей артисткой"
          "Для вас это очень ответсвенный день\n\n"
          "Что нужно сделать, чтобы исполнить свою мечту? \n\n"
          "ПОМНИТЕ! От ваших действий зависит сюжетная линия \n\n"
          "Сейчас вы отправляете в агенство для прослушивание.\n"
          "Какое агенство в выберите?")

SM = ('Вы выбрали самое крупное агенство! \n'
      'SM Entertainment продисирует самые ивестные группы в Корее! '
      'Самые топовые судьи будут оценивать ваше выступление, подготовитесь тщательно!'
      'Конкуренция будет очень высокая! Каждый мечтает дебютировать именно в этой компании \n'
      'Требования компании для прослушивания: \n'
      '-Превосходные навыки в вокале'
      '-Высокие навыки в k-pop танцах'
      '-Артистизм'
      '-Актёрскоё матерство')


STAR = ('Вы выбрали малоивестную компанию! \n'
        'Вы легко сможете пройти прослушивание, но у компании плохая репутация'
        'Частые скандалы и плохое продвижение ожидают вас'
        'Требования: \n'
        '-Средний уровень танцев и вокала \n'
        '-Знание языка \n\n'
        'Желаем удачи!!!')


DP = ('Вы выбрали начинающую, но очень перспективную компанию \n'
      'DP Entertainment бережно относитс к своим артистам и гарантирует хорошее продвижения'
      'Компания требует:'
      '-Высокие навыки в хип-хоп танцах \n'
      '-Средние вокальные навыки \n'
      '-Навык в написании песен \n'
      '-Уверенность на сцене \n'
      'Вы сделали хороший выбор!')


kpop_dance = ("Вы решили попробовать свои силы на кастинге по k-pop \n"
              "Вы тщательно готовилась к своему выступлению \n\n"
              "К сожалению, жюри не оценило ваше выступление так, как Вы ожидали. \n"
              "Они указали на некоторые недостатки в вашей технике и координации движений.\n"
              "Вы были разочарованы и расстроены, ведь Вы вложила столько усилий и стараний в свою подготовку."
              "Хотите ли ы продолжить историю?")

perfect_vocal = ("Вы решили попробовать свои силы на прослушивании в крупном музыкальном агентстве \n"
                 "В день прослушивания Вы пришли в агентство, где уже собралось множество других молодых людей, также желающих показать свои таланты. \n"
                 "Вы представили себя жюри, состоящему из опытных продюсеров и музыкантов."
                 "Вы начали свое выступление с мощного и эмоционального исполнения выбранной песни.\n"
                 "Жюри было поражено вашим талантом и потенциалом. "
                 "Они отметили ваше великолепное владение голосом, силу вашего исполнения и вашу естественную харизму на сцене. \n\n"
                 "Хотите ли ы продолжить историю?")


dance = ("Вы направились на прослушивание"
         "В зале было немного конкурентов, поэтом вы не волноваись \n"
         "Однако, во время танца, вы допустили небольшую ошибку. \n"
         "Вы немного споткнулись и потеряли равновесие. Несмотря на это, вы продолжили танец.")


vocal = ("Вы пришли в агентство, где было немного других конкурентов "
         "Судьи оценивали участников без особого энтузиазма и казалось, что им было всё равно на их выступления.\n"
         "Вы прошли прослушивание без особых усилий, так как Ваше выступление было убедительным и выделялось среди остальных. \n"
         "Вы были радостными и взволнованными, узнав, что вас приняли на прослушивание.")

hiphop_dance = ("Вы встречаете свою очередь на прослушивании в агентстве. \n"
                "Вы находитесь в ожидании великолепного зала."
                "Вы уверенно выходите на центральную сцену и начинаете свою танцевальную программу. \n"
                "Ее танец полон выразительности и эмоций, и она покоряет сердца зрителей.\n"
                "Судьи и соперницы наблюдают за вами с восхищением и удивлением."
                " Взгляды и аплодисменты наполняют зал, восхваляя ваше мастерство и талант. "
                "Вы продолжаете танцевать с полным преданностью и страстью. "
                "В конце выступления вы призываете аплодисменты, и зал заполняется громкими овациями.\n"
                "Это прослушивание станет для вас важным шагом на пути к мечте стать профессиональной танцовщицей. \n\n"
                "Хотите ли вы продолжить дальше?")

normal_vocal = ("В день прослушивания вы пришли в агентство, где было много других талантливых вокалистов."
                "Из-за чего вы очень волновались"
                "По середине выступления вы допустили ебольшую ошибку \n"
                "Судьи оценили ваше выступление неодобрительно и поставили вам низкие оценки."
                "вам следует больше тренироваться! \n\n"
                "Хотите продолжить историю?")

no = ("Вы решили сдаться(( \n"
      "Квиз закончен \n"
      "Если хочешь перепройти историю жми /start_story")


the_end1 = ("Поздравляем!! \n"
            "Вы смогли пройти сложное прослушивание и дебютировать в новой группе 'Baby Monster'\n"
            "Ваш талант и усердие помогли вам стать главным вокалистом, а группе — приобрести популярность."
            "Babe Monster станоятся королевами k-pop \n"
            "Теперь вы являетесь любимицей среди фанатов, которые ценят ваши музыкальные способности и харизму. \n\n"
            "Вы смогли осуществить мечту!!! \n"
            "Если хочешь перепройти историю жми /start_story")


the_end12 = ("Вы смогли дебютировать в новой группе SW \n"
             "Однако, судьи взял вас в группу только из-за вашей внешности \n"
             "Поэтому вы только вижуал в группе"
             "Многие фанаты недолюбливают вас, и считаю что вам не место в группе \n"
             "Однако, вы продолжаете оттачивать свои навыки и становтесь всё лучше!! \n\n"
             "Вы завершили историю! \n"
             "Если хочешь перепройти историю жми /start_story")

the_end2 = ("Вы смогли дебютировать сольно! \n"
            "Однако, после дебюта Вы стали замечать, что компания, в которой вы подписали контракт, не обеспечивает должную защиту и поддержку. \n "
            "Вы столкнулись с отвратительным отношением со стороны менеджеров."
            "У вас возникли проблемы с промоушеном вашей музыки, и вы ощутили отсутствие поддержки и развития вашей карьеры со стороны агентства."
            "Из-за крупного скандала вам пршлось покинуть индустрию развлечений, так как компания не защтила вас от хейтеров \n\n"
            "Неуданая концовка \n"
            "Сможете ли вы встать на ноги и попробовать дебютировать ещё раз? \n"
            "Если хочешь перепройти историю жми /start_story")

the_end3 = ("К сожалению, вы не смогли пройти прослушивание из-за ошибок в исполнении \n"
            "Вы чувствуете себя очень подавлено!"
            "Но вы не отчаитесь и попробуйте дебютировать в другой компании \n\n"
            "Вы всё сможете!!! \n"
            "Если хочешь перепройти историю жми /start_story")

the_end32 = ("Поздравляем!!\n"
             "Вы успешно дебютировали в новой группе 'three days of rain' \n"
             "Однако группа не получила должной популярности  пустя 2 года вашу группу расформировали "
             "Вы смогли найти силы и продолжить двигаться дальше!\n"
             "Позже вы стали топовым хореографом и преподаёте в лучшей студии!! \n"
             "Если хочешь перепройти историю жми /start_story")